# Запитуємо користувача ввести значення a, перевіряючи, що воно додатнє
while True:
    a = float(input("Введіть додатнє значення a: "))
    if a > 0:
        break
    else:
        print("Значення a повинно бути додатнім числом.")

# Запитуємо користувача ввести значення b, перевіряючи, що воно додатнє
while True:
    b = float(input("Введіть додатнє значення b: "))
    if b > 0:
        break
    else:
        print("Значення b повинно бути додатнім числом.")

# Обчислюємо значення X в залежності від умов
if a < b:
    x = a / b + 5
elif a == b:
    x = -5
else:
    x = (a * a - b) / b

# Виводимо обчислене значення X
print("Значення X:", x)
